{
  "config": {
    "step": {
      "user": {
        "title": "Contact Energy Account",
        "description": "Enter your Contact Energy account credentials to connect your account and verify connectivity.\n\n**Email Address**: The email address associated with your Contact Energy account. This is the email you use to log in to the Contact Energy website or mobile app.\n\n**Password**: Your Contact Energy account password. Your credentials are securely encrypted and used only to authenticate with Contact Energy's servers.\n\n**Use previous email address**: If you've already added a Contact Energy account to Home Assistant, you can select this option to reuse the same email address. Enter your password (which may be different if you've changed it) to continue.",
        "data": {
          "use_previous_email": "Use previous email",
          "email": "Email Address",
          "password": "Password"
        }
      },
      "select_account": {
        "title": "Confirm Account",
        "description": "You have one Contact Energy account.\n\n**Account Name:** {account_nickname}\n**ICP:** {icp}\n\nPlease confirm these are the correct details by pressing submit.",
        "data": {
          "account_icp": "Account (ICP - Address)",
          "confirmed_icp": "Account ICP"
        }
      }
    },
    "error": {
      "invalid_auth": "Authentication Failed - Invalid email or password. Please double-check your credentials and ensure caps lock is off. Contact Energy accounts are case-sensitive for passwords.",
      "connection_error": "Connection Error - Unable to connect to Contact Energy servers. This may be due to a network issue or Contact Energy API being temporarily unavailable. Please check your internet connection and try again.",
      "api_error": "API Error - Contact Energy servers returned an error. Please try again later or contact Contact Energy support if the problem persists.",
      "no_accounts": "No Accounts Found - Your Contact Energy account exists but has no active accounts or ICPs. Please contact Contact Energy support to activate your account.",
      "no_available_accounts": "No Available Accounts - All your Contact Energy accounts have already been added to Home Assistant. If you want to add another account, please use different login credentials.",
      "unknown": "Unknown Error - An unexpected error occurred. Please try again or contact support if the problem persists."
    },
    "abort": {
      "already_configured": "Contact Energy is already configured in Home Assistant"
    }
  },
  "options": {
    "step": {
      "user": {
        "title": "Contact Energy Options",
        "description": "Configure Contact Energy integration options"
      }
    }
  }
}
